# 进程 vs. 线程
### 讨论一下这两种方式的优缺点:

"""
首先，要实现多任务，通常我们会设计Master-Worker模式，
Master负责分配任务，Worker负责执行任务，
因此，多任务环境下，通常是一个Master，多个Worker。

如果用多进程实现Master-Worker，主进程就是Master，其他进程就是Worker。

如果用多线程实现Master-Worker，主线程就是Master，其他线程就是Worker。
"""

##### 多进程模式最大的优点:
"""
就是稳定性高，因为一个子进程崩溃了，不会影响主进程和其他子进程。
（当然主进程挂了所有进程就全挂了，但是Master进程只负责分配任务，挂掉的概率低）著名的Apache最早就是采用多进程模式。
"""

##### 多进程模式的缺点:
"""
创建进程的代价大，在Unix/Linux系统下，用fork调用还行，
在Windows下创建进程开销巨大。
另外，操作系统能同时运行的进程数也是有限的，
在内存和CPU的限制下，如果有几千个进程同时运行，操作系统连调度都会成问题。
"""

##### 多线程模式的缺点:
"""
多线程模式通常比多进程快一点，但是也快不到哪去，
而且，多线程模式致命的缺点就是任何一个线程挂掉都可能直接造成整个进程崩溃，
因为所有线程共享进程的内存。
在Windows上，如果一个线程执行的代码出了问题，
你经常可以看到这样的提示：“该程序执行了非法操作，即将关闭”，
其实往往是某个线程出了问题，但是操作系统会强制结束整个进程。
"""

### 计算密集型 vs. IO密集型

##### 计算密集型:
"""
特点：
要进行大量的计算，消耗CPU资源，比如计算圆周率、对视频进行高清解码等等，全靠CPU的运算能力。
这种计算密集型任务虽然也可以用多任务完成，但是任务越多，花在任务切换的时间就越多，
CPU执行任务的效率就越低，所以，要最高效地利用CPU，计算密集型任务同时进行的数量应当等于CPU的核心数。

计算密集型任务由于主要消耗CPU资源，
因此，代码运行效率至关重要。
Python这样的脚本语言运行效率很低，完全不适合计算密集型任务。
对于计算密集型任务，最好用C语言编写。
"""

##### IO密集型：
"""
特点：
涉及到网络、磁盘IO的任务都是IO密集型任务。
这类任务的特点是CPU消耗很少，
任务的大部分时间都在等待IO操作完成（因为IO的速度远远低于CPU和内存的速度）。
对于IO密集型任务，任务越多，CPU效率越高，但也有一个限度。
常见的大部分任务都是IO密集型任务，比如Web应用。

IO密集型任务执行期间，99%的时间都花在IO上，花在CPU上的时间很少，
因此，用运行速度极快的C语言替换用Python这样运行速度极低的脚本语言，完全无法提升运行效率。
对于IO密集型任务，最合适的语言就是开发效率最高（代码量最少）的语言，脚本语言是首选，C语言最差。
"""

### 异步IO
"""
事件驱动，回调，单进程高效
"""

####### 对应到Python语言，单线程的异步编程模型称为协程，有了协程的支持，就可以基于事件驱动编写高效的多任务程序